Repository: WordPressBugBounty/plugins-sumup-payment-gateway-for-woocommerce
Catalog: sumup-payment-gateway-for-woocommerce/languages/sumup-payment-gateway-for-woocommerce-*.po
Languages: et_ee, lv_lv, ro_ro

source: Take credit card payments on your store using SumUp.
et_ee: Võtke oma poes krediitkaardimakseid vastu SumUpi abil.
lv_lv: Pieņemiet kredītkaršu maksājumus savā veikalā, izmantojot SumUp.
ro_ro: Aceite pagini com cartayo de crédito na sua loja usando o SumUp.

source: Merchant account settings are incorrectly configured. Check the plugin settings page.
et_ee: Kaupmehe konto seaded on valesti konfigureeritud. Kontrollige plugina seadete lehte.
lv_lv: Tirgotāja konta iestatījumi ir nepareizi konfigurēti. Pārbaudiet spraudņa iestatījumu lapu.
ro_ro: Setările contului comerciantului sunt configurate incorect. Verificați pagina de setări a plugin-ului.

source: Sumup is temporarily unavailable. Please contact site admin for more information.
et_ee: Sumup on ajutiselt saadaval. Lisateabe saamiseks võtke ühendust saidi administraatoriga.
lv_lv: SumUp ir īslaicīgi nepieejams. Lūdzu, sazinieties ar vietnes administratoru, lai iegūtu vairāk informācijas.
ro_ro: Sumup este temporar indisponibil. Vă rugăm să contactați administratorul site-ului pentru mai multe informații.

source: Order ID is not available to make the payment. Try again soon or contact the website support.
et_ee: Tellimuse ID pole makse tegemiseks saadaval. Proovige peagi uuesti või võtke ühendust veebisaidi toega.
lv_lv: Pasūtījuma ID nav pieejams, lai veiktu maksājumu. Mēģiniet vēlreiz drīz vai sazinieties ar vietnes atbalstu.
ro_ro: ID-ul comenzii nu este disponibil pentru efectuarea plății. Încercați din nou în curând sau contactați asistența site-ului.

source: Transaction was unsuccessful. Please check the minimum amount or use another valid card.
et_ee: Tehing ebaõnnestus. Kontrollige minimaalset summat või kasutage teist kehtivat kaarti.
lv_lv: Transakcija neizdevās. Lūdzu, pārbaudiet minimālo summu vai izmantojiet citu derīgu karti.
ro_ro: Tranzacția nu a avut succes. Vă rugăm să verificați suma minimă sau să utilizați un alt card valabil.

source: Fill in all required details.
et_ee: Täida kõik vajalikud andmed.
lv_lv: Aizpildiet visus nepieciešamos datus.
ro_ro: Completați toate detaliile necesare.

source: Invalid Client ID, Client Secret or API Key.
et_ee: Kehtetu kliendi ID, kliendi salajane võti või API võti.
lv_lv: Nederīgs Klienta ID, Klienta noslēpums vai API atslēga.
ro_ro: Invalid Client ID, Client Secret sau Cheie API.

source: Missing scope: payments. Please contact support team.
et_ee: Puuduv ulatus: maksed. Võtke ühendust tugimeeskonnaga.
lv_lv: Trūkst darbības jomas: maksājumi. Lūdzu, sazinieties ar atbalsta komandu.
ro_ro: Domeniul de aplicare lipsă: plăți. Vă rugăm să contactați echipa de asistență.

source: Credentials are not valid. Please check the plugin log and try again.
et_ee: Mandaat ei ole kehtiv. Kontrollige plugina logi ja proovige uuesti.
lv_lv: Akreditācijas dati nav derīgi. Lūdzu, pārbaudiet spraudņa žurnālu un mēģiniet vēlreiz.
ro_ro: Acreditările nu sunt valabile. Vă rugăm să verificați jurnalul plugin-ului și să încercați din nou.

source: Credentials are not valid. Please check and try again.
et_ee: Mandaat ei ole kehtiv. Kontrollige ja proovige uuesti.
lv_lv: Akreditācijas dati nav derīgi. Lūdzu, pārbaudiet un mēģiniet vēlreiz.
ro_ro: Acreditările nu sunt valabile. Vă rugăm să verificați și să încercați din nou.

source: Your credentials are valid and you are ready to use the plugin.
et_ee: Teie mandaat on kehtiv ja olete valmis plugina kasutamiseks.
lv_lv: Jūsu akreditācijas dati ir derīgi, un jūs esat gatavs izmantot spraudni.
ro_ro: Acreditările dumneavoastră sunt valabile și sunteți gata să utilizați plugin-ul.

source: SumUp works by adding payment fields on the checkout and then sending the details to SumUp for verification. <a href="%1$s" target="_blank">Sign up</a> for a SumUp account. After logging in, <a href="%2$s" target="_blank">get your SumUp account keys</a>.
et_ee: SumUp töötab, lisades makseväljad kassasse ja seejärel saates üksikasjad kinnitamiseks SumUpile. <a href=\"%1$s\" target=\"_blank\">Registreeru</a> SumUp konto jaoks. Pärast sisselogimist, <a href=\"%2$s\" target=\"_blank\">hankige oma SumUp konto võtmed</a>.
lv_lv: SumUp darbojas, pievienojot maksājumu laukus izrakstīšanās laikā un pēc tam nosūtot datus uz SumUp pārbaudei. <a href="%1$s" target="_blank">Reģistrējieties</a> SumUp kontam. Pēc pieteikšanās <a href="%2$s" target="_blank">iegūstiet savas SumUp konta atslēgas</a>.
ro_ro: SumUp funcționează prin adăugarea câmpurilor de plată la checkout și apoi trimiterea detaliilor către SumUp pentru verificare. <a href="%1$s" target="_blank">Înscrieți-vă</a> pentru un cont SumUp. După ce vă conectați, <a href="%2$s" target="_blank">obțineți cheile contului SumUp</a>.

source: SumUp charge complete. Transaction Code: %s
et_ee: SumUp laadimine lõpetatud. Tehingu kood: %s
lv_lv: SumUp maksājums pabeigts. Transakcijas kods: %s
ro_ro: SumUp taxa completă. Codul Tranzacției: %s

source: SumUp payment failed.
et_ee: SumUp makse ebaõnnestus.
lv_lv: SumUp maksājums neizdevās.
ro_ro: Plata SumUp a eșuat.

source: Payment failed, please try again.
et_ee: Makse ebaõnnestus, proovige uuesti.
lv_lv: Maksājums neizdevās, lūdzu, mēģiniet vēlreiz.
ro_ro: Plata a eșuat, vă rugăm să încercați din nou.

source: Error: Merchant account settings are incorrectly configured. Check the plugin settings page.
et_ee: Viga: kaupmehe konto seaded on valesti konfigureeritud. Kontrollige plugina seadete lehte.
lv_lv: Kļūda: Tirgotāja konta iestatījumi ir nepareizi konfigurēti. Pārbaudiet spraudņa iestatījumu lapu.
ro_ro: Eroare: Setările contului comerciantului sunt configurate incorect. Verificați pagina de setări a plugin-ului.

source: Sum up is temporarily unavailable. Please contact site admin for more information.
et_ee: SumUp on ajutiselt saadaval. Lisateabe saamiseks võtke ühendust saidi administraatoriga.
lv_lv: SumUp ir īslaicīgi nepieejams. Lūdzu, sazinieties ar vietnes administratoru, lai iegūtu vairāk informācijas.
ro_ro: Suma este temporar indisponibilă. Vă rugăm să contactați administratorul site-ului pentru mai multe informații.

source: Payment Status:
et_ee: Makse olek:
lv_lv: Maksājuma statuss:
ro_ro: Starea plății:

source: Payment instructions
et_ee: Maksmise juhised
lv_lv: Maksājuma instrukcijas
ro_ro: Instrucțiunile de plată

source: Download Boleto
et_ee: Laadi alla Boleto
lv_lv: Lejupielādēt Boleto
ro_ro: Descarcă Boleto

source: Code to pay:
et_ee: Kood maksmiseks:
lv_lv: Kods maksājumam:
ro_ro: Cod de plată:

source: Enable/Disable
et_ee: Lubamine/Keelamine
lv_lv: Ieslēgt/Izslēgt
ro_ro: Activa/Dezactiva

source: Enable SumUp
et_ee: Luba SumUp
lv_lv: Ieslēgt SumUp
ro_ro: Activează SumUp

source: Title
et_ee: Pealkiri
lv_lv: Nosaukums
ro_ro: Titlu

source: This controls the title the user sees during checkout.
et_ee: See kontrollib pealkirja, mida kasutaja näeb kassas.
lv_lv: Tas kontrolē nosaukumu, ko lietotājs redz izrakstīšanās laikā.
ro_ro: Aceasta controlează titlul pe care utilizatorul îl vede în timpul checkout-ului.

source: Pay with SumUp
et_ee: Maksa SumUp'iga
lv_lv: Maksājiet ar SumUp
ro_ro: Plătiți cu SumUp

source: Description
et_ee: Kirjeldus
lv_lv: Apraksts
ro_ro: Descriere

source: This controls the description the user sees during checkout.
et_ee: See kontrollib kirjeldust, mida kasutaja näeb kassas.
lv_lv: Tas kontrolē aprakstu, ko lietotājs redz izrakstīšanās laikā.
ro_ro: Aceasta controlează descrierea pe care utilizatorul o vede în timpul plății.

source: You can choose how you'd like to pay after you place your order.
et_ee: Saate valida, kuidas soovite maksta pärast tellimuse esitamist.
lv_lv: Jūs varat izvēlēties, kā vēlaties maksāt pēc pasūtījuma veikšanas.
ro_ro: Puteți alege cum doriți să plătiți după ce plasați comanda.

source: Merchant ID
et_ee: Kaupmehe ID
lv_lv: Tirgotāja ID

source: Get your Merchant ID from your SumUp account:
et_ee: Hankige oma kaupmehe ID oma SumUp kontolt:
lv_lv: Iegūstiet savu Tirgotāja ID no sava SumUp konta:
ro_ro: Obțineți Merchant ID-ul din contul SumUp:

source: API Key
et_ee: API võti
lv_lv: API atslēga

source: Create and get your API Key:
et_ee: Looge ja hankige oma API võti:
lv_lv: Izveidojiet un iegūstiet savu API atslēgu:
ro_ro: Creați și obțineți API Key:

source: developer settings
et_ee: arendaja seaded
lv_lv: izstrādātāja iestatījumi
ro_ro: setări dezvoltator

source: Client ID
et_ee: Kliendi ID
lv_lv: Klienta ID

source: Create and get your Client ID:
et_ee: Looge ja hankige oma kliendi ID:
lv_lv: Izveidojiet un iegūstiet savu Klienta ID:
ro_ro: Creați și obțineți Client ID-ul:

source: Client Secret
et_ee: Kliendi salajane võti
lv_lv: Klienta noslēpums

source: Create and get your Client Secret:
et_ee: Looge ja hankige oma kliendi salajane võti:
lv_lv: Izveidojiet un iegūstiet savu Klienta noslēpumu:
ro_ro: Creați și obțineți Client Secret:

source: SumUp Profile Email
et_ee: SumUp profiili e-post
lv_lv: SumUp profila e-pasts
ro_ro: SumUp Profil E-mail

source: Get your Email from your SumUp account.
et_ee: Hankige oma e-post oma SumUp kontolt.
lv_lv: Iegūstiet savu e-pastu no sava SumUp konta.
ro_ro: Obțineți adresa de e-mail din contul SumUp.

source: Logging
et_ee: Logimine
lv_lv: Žurnālu veidošana
ro_ro: Logare

source: Log debug messages
et_ee: Logi silumissõnumeid
lv_lv: Žurnālu atkļūdošanas ziņojumi
ro_ro: Log mesaje de depanare

source: Save debug messages to the WooCommerce System Status log.
et_ee: Salvesta silumissõnumid WooCommerce süsteemi oleku logisse.
lv_lv: Saglabājiet atkļūdošanas ziņojumus WooCommerce sistēmas statusa žurnālā.
ro_ro: Salvați mesajele de depanare în jurnalul de stare al sistemului WooCommerce.

source: Installments
et_ee: Osamaksed
lv_lv: Maksājumi pa daļām
ro_ro: Rate

source: Enable Installments?
et_ee: Lubada osamaksed?
lv_lv: Ieslēgt maksājumus pa daļām?
ro_ro: Activați Ratele?

source: Accept installments in your card payment method.
et_ee: Nõustuge osamaksetega oma kaardimakse meetodis.
lv_lv: Pieņemiet maksājumus pa daļām savā kartes maksājumu metodē.
ro_ro: Acceptați rate în metoda de plată cu cardul.

source: Number of Installments
et_ee: Osamaksete arv
lv_lv: Maksājumu pa daļām skaits
ro_ro: Numarul de Rate

source: Define the number of installments you will accept.
et_ee: Määrake osamaksete arv, mida te aktsepteerite.
lv_lv: Norādiet maksājumu pa daļām skaitu, ko pieņemsiet.
ro_ro: Definiți numărul de rate pe care le veți accepta.

source: Enable PIX?
et_ee: Lubada PIX?
ro_ro: Activați PIX?

source: Enable
et_ee: Luba
lv_lv: Ieslēgt
ro_ro: Activa

source: Open Payment in modal?
et_ee: Kas avada makse modaalselt?
lv_lv: Atvērt maksājumu modālajā logā?
ro_ro: Deschideți Plata în modal?

source: Yes
et_ee: Jah
lv_lv: Jā
ro_ro: Da

source: Open the Payment options inside a modal (popup)
et_ee: Ava maksevalikud modaalis (hüpikaknas)
lv_lv: Atvērt maksājuma iespējas modālajā logā (iznirstošajā logā)
ro_ro: Deschideți opțiunile de plată în interiorul unui modal (popup)

source: Docs
et_ee: Dokumendid
lv_lv: Dokumentācija
ro_ro: Documentație

source: SumUp requires WooCommerce to be installed and active. You can download %s here.
et_ee: SumUp nõuab, et WooCommerce oleks installitud ja aktiivne. Siit saate alla laadida %s.
lv_lv: SumUp prasa, lai WooCommerce būtu instalēts un aktīvs. Jūs varat lejupielādēt %s šeit.
ro_ro: SumUp necesită instalarea și activarea WooCommerce. Puteți descărca %s aici.

source: SumUp Gateway is almost ready. To get started, <a href="%s">set your SumUp account keys</a>.
et_ee: SumUp Gateway on peaaegu valmis. Alustamiseks <a href=\"%s\">seadke oma SumUpi konto võtmed</a>.
lv_lv: SumUp vārteja ir gandrīz gatava. Lai sāktu, <a href="%s">iestatiet savas SumUp konta atslēgas</a>.
ro_ro: SumUp Gateway este aproape gata. Pentru a începe, <a href="%s">setați tastele contului SumUp</a>.

source: SumUp Gateway is not configured properly. You can fix this from <a href="%s">here</a>.
et_ee: SumUp Gateway ei ole õigesti konfigureeritud. Selle saate parandada <a href=\"%s\">siit</a>.
lv_lv: SumUp vārteja nav pareizi konfigurēta. To var labot <a href="%s">šeit</a>.
ro_ro: SumUp Gateway nu este configurat corect. Puteți rezolva acest lucru de <a href="%s">aici</a>.

source: SumUp Gateway needs your attention. Currency is different from WooCommerce currency (WooCommerce->Settings->General->Currency).
et_ee: SumUp Gateway vajab teie tähelepanu. Valuuta erineb WooCommerce'i valuutast (WooCommerce->Settings->General->Currency).
lv_lv: SumUp vārteja prasa jūsu uzmanību. Valūta atšķiras no WooCommerce valūtas (WooCommerce->Iestatījumi->Vispārējie->Valūta).
ro_ro: SumUp Gateway are nevoie de atenția dumneavoastră. Moneda este diferită de moneda WooCommerce (WooCommerce->Setările->General->Monedă).

source: SumUp Gateway is not configured properly. Please fill the field Merchant ID.
et_ee: SumUp Gateway ei ole õigesti konfigureeritud. Palun täitke väli Kaupmehe ID.
lv_lv: SumUp vārteja nav pareizi konfigurēta. Lūdzu, aizpildiet lauku Tirgotāja ID.

source: Settings
et_ee: Seaded
lv_lv: Iestatījumi
ro_ro: Setările

source: %1$s requires PHP version %2$s or greater.
et_ee: %1$s nõuab PHP versiooni %2$s või uuemat.
lv_lv: %1$s prasa PHP versiju %2$s vai jaunāku.
ro_ro: %1$s necesită versiunea PHP %2$s sau mai mare.

source: %1$s requires WordPress version %2$s or greater.
et_ee: %1$s nõuab WordPressi versiooni %2$s või uuemat.
lv_lv: %1$s prasa WordPress versiju %2$s vai jaunāku.
ro_ro: %1$s necesită versiunea WordPress %2$s sau mai mare.

source: SumUp account not connected
et_ee: SumUpi konto pole ühendatud
lv_lv: SumUp konts nav pievienots
ro_ro: Contul SumUp nu este conectat

source: Credentials are not valid. Please try again.
et_ee: Mandaat ei kehti. Palun proovi uuesti.
lv_lv: Akreditācijas dati nav derīgi. Lūdzu, mēģiniet vēlreiz.
ro_ro: Acreditările nu sunt valabile. Vă rugăm să încercați din nou.

source: SumUp account connected
et_ee: SumUpi konto on ühendatud
lv_lv: SumUp konts ir pievienots
ro_ro: Cont SumUp conectat

source: WooCommerce can now accept payments via SumUp
et_ee: WooCommerce saab nüüd SumUpi kaudu makseid vastu võtta
lv_lv: WooCommerce tagad var pieņemt maksājumus ar SumUp
ro_ro: WooCommerce poate accepta acum plăți prin SumUp

source: Accept payments through your SumUp account in WooCommerce. Take all payments in your online store with an easy and quick integration. No coding required.
et_ee: Võtke vastu makseid oma SumUpi konto kaudu WooCommerce'is. Võtke kõik maksed oma veebipoes vastu lihtsa ja kiire integreerimisega. Kodeerimine pole vajalik.
lv_lv: Pieņemiet maksājumus caur savu SumUp kontu WooCommerce. Pieņemiet visus maksājumus savā tiešsaistes veikalā ar vieglu un ātru integrāciju. Kods nav nepieciešams.
ro_ro: Acceptați plăți prin contul SumUp în WooCommerce. Ia toate plățile în magazinul online, cu o integrare ușoară și rapidă. Nu este necesară codarea.

source: Connect in 4 steps:
et_ee: Ühenda 4 sammuga:
lv_lv: Pievienojieties 4 soļos:
ro_ro: Conectați-vă în 4 pași:

source: Start by connecting your account. Learn more
et_ee: Alustage oma konto ühendamisega. Lisateave
lv_lv: Sāciet, pievienojot savu kontu. Uzziniet vairāk
ro_ro: Începeți prin conectarea contului. Află mai multe

source: Log into your SumUp account, if you are not already logged in.
et_ee: Logi sisse oma SumUpi kontole, kui te pole veel sisse logitud.
lv_lv: Piesakieties savā SumUp kontā, ja vēl neesat pieteicies.
ro_ro: Conectați-vă la contul SumUp, dacă nu sunteți deja conectat.

source: Select the “Connect” button to begin.
et_ee: Alustamiseks vali nupp "Ühenda.
lv_lv: Lai sāktu, izvēlieties pogu “Pievienot”.
ro_ro: Selectați butonul "Conecta" pentru a începe.

source: Return to WooCommerce by selecting the “View plugin” button.
et_ee: Naaske WooCommerce'i, valides nupu "Kuva pistikprogramm".
lv_lv: Atgriezieties WooCommerce, izvēloties pogu “Skatīt spraudni”.
ro_ro: Reveniți la WooCommerce selectând butonul “Vizualizați pluginul”.

source: Advanced Version
et_ee: Täiustatud versioon
lv_lv: Paplašinātā versija
ro_ro: Versiune Avansată

source: Connect Account
et_ee: Ühenda konto
lv_lv: Pievienot kontu
ro_ro: Conectați Cont

source: Accept PIX as your payment method.
lv_lv: Pieņemiet PIX kā savu maksājumu metodi.
ro_ro: Acceptați PIX ca metodă de plată.

source: PIX code:
ro_ro: Cod PIX:

source: Please use the “Connect Account” button to start the configuration.
ro_ro: Vă rugăm să folosiți butonul “Conectați Cont” pentru a porni configurarea.
